package assignment;

import java.util.Map;

import lombok.AllArgsConstructor;
import lombok.Data;

import static java.util.Map.entry;

import java.util.List;

class Grades {
    static Map<Integer, List<Grade>> scores = Map.ofEntries(
            entry(191250013,
                    List.of(new Grade("平时成绩", 191250013, 15, 1), new Grade("期末成绩", 191250013, 33, 9),
                            new Grade("总评成绩", 191250013, 13, 2), new Grade("平时成绩", 191250013, 87, 10),
                            new Grade("期末成绩", 191250013, 52, 3), new Grade("总评成绩", 191250013, 60, 11),
                            new Grade("平时成绩", 191250013, 73, 4), new Grade("期末成绩", 191250013, 48, 12),
                            new Grade("总评成绩", 191250013, 14, 5), new Grade("平时成绩", 191250013, 52, 13),
                            new Grade("期末成绩", 191250013, 5, 6), new Grade("总评成绩", 191250013, 17, 14),
                            new Grade("平时成绩", 191250013, 54, 7), new Grade("期末成绩", 191250013, 92, 15),
                            new Grade("总评成绩", 191250013, 65, 8))),
            entry(191250150,
                    List.of(new Grade("平时成绩", 191250150, 15, 1), new Grade("期末成绩", 191250150, 33, 9),
                            new Grade("总评成绩", 191250150, 13, 2), new Grade("平时成绩", 191250150, 87, 10),
                            new Grade("期末成绩", 191250150, 52, 3), new Grade("总评成绩", 191250150, 60, 11),
                            new Grade("平时成绩", 191250150, 73, 4), new Grade("期末成绩", 191250150, 48, 12),
                            new Grade("总评成绩", 191250150, 14, 5), new Grade("平时成绩", 191250150, 52, 13),
                            new Grade("期末成绩", 191250150, 5, 6), new Grade("总评成绩", 191250150, 17, 14),
                            new Grade("平时成绩", 191250150, 54, 7), new Grade("期末成绩", 191250150, 92, 15),
                            new Grade("总评成绩", 191250150, 65, 8))),
            entry(191250128,
                    List.of(new Grade("平时成绩", 191250128, 15, 1), new Grade("期末成绩", 191250128, 33, 9),
                            new Grade("总评成绩", 191250128, 13, 2), new Grade("平时成绩", 191250128, 87, 10),
                            new Grade("期末成绩", 191250128, 52, 3), new Grade("总评成绩", 191250128, 60, 11),
                            new Grade("平时成绩", 191250128, 73, 4), new Grade("期末成绩", 191250128, 48, 12),
                            new Grade("总评成绩", 191250128, 14, 5), new Grade("平时成绩", 191250128, 52, 13),
                            new Grade("期末成绩", 191250128, 5, 6), new Grade("总评成绩", 191250128, 17, 14),
                            new Grade("平时成绩", 191250128, 54, 7), new Grade("期末成绩", 191250128, 92, 15),
                            new Grade("总评成绩", 191250128, 65, 8))),
            entry(191250065,
                    List.of(new Grade("平时成绩", 191250065, 15, 1), new Grade("期末成绩", 191250065, 33, 9),
                            new Grade("总评成绩", 191250065, 13, 2), new Grade("平时成绩", 191250065, 87, 10),
                            new Grade("期末成绩", 191250065, 52, 3), new Grade("总评成绩", 191250065, 60, 11),
                            new Grade("平时成绩", 191250065, 73, 4), new Grade("期末成绩", 191250065, 48, 12),
                            new Grade("总评成绩", 191250065, 14, 5), new Grade("平时成绩", 191250065, 52, 13),
                            new Grade("期末成绩", 191250065, 5, 6), new Grade("总评成绩", 191250065, 17, 14),
                            new Grade("平时成绩", 191250065, 54, 7), new Grade("期末成绩", 191250065, 92, 15),
                            new Grade("总评成绩", 191250065, 65, 8))),
            entry(191250206,
                    List.of(new Grade("平时成绩", 191250206, 15, 1), new Grade("期末成绩", 191250206, 33, 9),
                            new Grade("总评成绩", 191250206, 13, 2), new Grade("平时成绩", 191250206, 87, 10),
                            new Grade("期末成绩", 191250206, 52, 3), new Grade("总评成绩", 191250206, 60, 11),
                            new Grade("平时成绩", 191250206, 73, 4), new Grade("期末成绩", 191250206, 48, 12),
                            new Grade("总评成绩", 191250206, 14, 5), new Grade("平时成绩", 191250206, 52, 13),
                            new Grade("期末成绩", 191250206, 5, 6), new Grade("总评成绩", 191250206, 17, 14),
                            new Grade("平时成绩", 191250206, 54, 7), new Grade("期末成绩", 191250206, 92, 15),
                            new Grade("总评成绩", 191250206, 65, 8))),
            entry(191250089,
                    List.of(new Grade("平时成绩", 191250089, 15, 1), new Grade("期末成绩", 191250089, 33, 9),
                            new Grade("总评成绩", 191250089, 13, 2), new Grade("平时成绩", 191250089, 87, 10),
                            new Grade("期末成绩", 191250089, 52, 3), new Grade("总评成绩", 191250089, 60, 11),
                            new Grade("平时成绩", 191250089, 73, 4), new Grade("期末成绩", 191250089, 48, 12),
                            new Grade("总评成绩", 191250089, 14, 5), new Grade("平时成绩", 191250089, 52, 13),
                            new Grade("期末成绩", 191250089, 5, 6), new Grade("总评成绩", 191250089, 17, 14),
                            new Grade("平时成绩", 191250089, 54, 7), new Grade("期末成绩", 191250089, 92, 15),
                            new Grade("总评成绩", 191250089, 65, 8))),
            entry(191250175,
                    List.of(new Grade("平时成绩", 191250175, 15, 1), new Grade("期末成绩", 191250175, 33, 9),
                            new Grade("总评成绩", 191250175, 13, 2), new Grade("平时成绩", 191250175, 87, 10),
                            new Grade("期末成绩", 191250175, 52, 3), new Grade("总评成绩", 191250175, 60, 11),
                            new Grade("平时成绩", 191250175, 73, 4), new Grade("期末成绩", 191250175, 48, 12),
                            new Grade("总评成绩", 191250175, 14, 5), new Grade("平时成绩", 191250175, 52, 13),
                            new Grade("期末成绩", 191250175, 5, 6), new Grade("总评成绩", 191250175, 17, 14),
                            new Grade("平时成绩", 191250175, 54, 7), new Grade("期末成绩", 191250175, 92, 15),
                            new Grade("总评成绩", 191250175, 65, 8))),
            entry(191830164,
                    List.of(new Grade("平时成绩", 191830164, 15, 1), new Grade("期末成绩", 191830164, 33, 9),
                            new Grade("总评成绩", 191830164, 13, 2), new Grade("平时成绩", 191830164, 87, 10),
                            new Grade("期末成绩", 191830164, 52, 3), new Grade("总评成绩", 191830164, 60, 11),
                            new Grade("平时成绩", 191830164, 73, 4), new Grade("期末成绩", 191830164, 48, 12),
                            new Grade("总评成绩", 191830164, 14, 5), new Grade("平时成绩", 191830164, 52, 13),
                            new Grade("期末成绩", 191830164, 5, 6), new Grade("总评成绩", 191830164, 17, 14),
                            new Grade("平时成绩", 191830164, 54, 7), new Grade("期末成绩", 191830164, 92, 15),
                            new Grade("总评成绩", 191830164, 65, 8))),
            entry(191850059,
                    List.of(new Grade("平时成绩", 191850059, 15, 1), new Grade("期末成绩", 191850059, 33, 9),
                            new Grade("总评成绩", 191850059, 13, 2), new Grade("平时成绩", 191850059, 87, 10),
                            new Grade("期末成绩", 191850059, 52, 3), new Grade("总评成绩", 191850059, 60, 11),
                            new Grade("平时成绩", 191850059, 73, 4), new Grade("期末成绩", 191850059, 48, 12),
                            new Grade("总评成绩", 191850059, 14, 5), new Grade("平时成绩", 191850059, 52, 13),
                            new Grade("期末成绩", 191850059, 5, 6), new Grade("总评成绩", 191850059, 17, 14),
                            new Grade("平时成绩", 191850059, 54, 7), new Grade("期末成绩", 191850059, 92, 15),
                            new Grade("总评成绩", 191850059, 65, 8))),
            entry(191250158,
                    List.of(new Grade("平时成绩", 191250158, 15, 1), new Grade("期末成绩", 191250158, 33, 9),
                            new Grade("总评成绩", 191250158, 13, 2), new Grade("平时成绩", 191250158, 87, 10),
                            new Grade("期末成绩", 191250158, 52, 3), new Grade("总评成绩", 191250158, 60, 11),
                            new Grade("平时成绩", 191250158, 73, 4), new Grade("期末成绩", 191250158, 48, 12),
                            new Grade("总评成绩", 191250013, 14, 5), new Grade("平时成绩", 191250158, 52, 13),
                            new Grade("期末成绩", 191250158, 5, 6), new Grade("总评成绩", 191250158, 17, 14),
                            new Grade("平时成绩", 191250158, 54, 7), new Grade("期末成绩", 191250158, 92, 15),
                            new Grade("总评成绩", 191250158, 65, 8))),
            entry(191250099,
                    List.of(new Grade("平时成绩", 191250099, 15, 1), new Grade("期末成绩", 191250099, 33, 9),
                            new Grade("总评成绩", 191250099, 13, 2), new Grade("平时成绩", 191250099, 87, 10),
                            new Grade("期末成绩", 191250099, 52, 3), new Grade("总评成绩", 191250099, 60, 11),
                            new Grade("平时成绩", 191250099, 73, 4), new Grade("期末成绩", 191250099, 48, 12),
                            new Grade("总评成绩", 191250099, 14, 5), new Grade("平时成绩", 191250099, 52, 13),
                            new Grade("期末成绩", 191250099, 5, 6), new Grade("总评成绩", 191250099, 17, 14),
                            new Grade("平时成绩", 191250099, 54, 7), new Grade("期末成绩", 191250099, 92, 15),
                            new Grade("总评成绩", 191250099, 65, 8))));
}

@Data
@AllArgsConstructor
class Grade {
    String type;
    Integer id;
    Integer grade;
    Integer courseId;
}
